// >=
//<=
//!=
//=
//> <

//==
//===

// let a = 10
// let b = 20
//
// console.log(a>b)
// console.log(a<b)
// console.log(a === b)
// console.log(b === a)
// console.log(a !==b)
// console.log(a==b)

// // Number
// let  n = '10'
// let b = 10
//
//
// console.log(Number(n) ,10)
// console.log(b)
// console.log(n)

// // parseInt
// // console.log(parseInt(n))
//
// // +
// // console.log(+n)
// // NaN-Not a number
//
// let a = 'developer'
// console.log(+a)
// let str = '10'
//
// // сторка бизге ак болуп корунот
// // сан болсо сары болуп корунот
// console.log(str,10)
//
// // СТОРОКАНЫ БИЗГЕ САНГА АЙЛАНТКАН МЕТОТТОР
//
//


// Number
// parseInt
// +
// NaN-Not a number


// let arr = 100

// String()

// console.log(String(arr))
//
// // toString()
//
// console.log(arr.toString())
//
//  + ""
//
// console.log(arr +'')
// // console.log(1000 +'werert')
// console.log(Number("5" * "5"))
// console.log("7" +7)
// console.log(Number('10') + parseInt('10') + +10)
// console.log('10' + '10')
//
// console.log('5' * '5')
// console.log()

// let a = 10
// let b = 20
// let c ='10'

// console.log(a ==b)
// console.log(a === b)


// == бул эки барабар бизге биринчи бир типке алып келет анан салыштырат мындайча айтканда сторока кылат же сан кылат

// === сторогоя равно

// console.log(a == c)
// console.log(a ===c )
// console.log( Number(a) === parseInt(c) )

// let flag = 'yellow'
//
//
// if (flag === 'green'){
//   console.log('goo')
//
// } else if(flag === "yellow"){
//   console.log('get ready')
// }else  {
//   console.log('stop')
// }


// if (10 === "20"){
//   console.log(true)
// }else {
//   console.log(false)
// }


// 1. Вам дана переменная num, присвойте ей значение.
// Выведите значение этой переменной в консоль.

// let num = 15
// console.log(num)


// 2. Вам даны переменные a=10, b=2 и c=5.
// Выведите в консоль их сумму.
// let a =10
// let b =2
// let c =5
//
// console.log(a + c + b)

// 3. Вам дана переменная со значением 100,
// выведите в консоль умноженную переменную на 2.
//
// let a =100
// let b =2
// console.log(a * b)

// 4. Вам дана переменная со значением 67.
// Выведите в консоль остаток деления на 7.
// let a = 67
// let b = 7
//
// console.log(Math.round(a / b))

// 5. Вам даны переменные a=10 и b=2.
// Выведите в консоль их сумму, разность,
// произведение и частное (результат деления).

// let a = 10
// let b = 2
// console.log(a + b)
// console.log(a - b)
// console.log(a * b)
// console.log(a / b)

// 6. Вам даны переменные c=15 и d=2.
// Просуммируйте их, а результат присвойте переменной result.
// Выведите в консоль значение переменной result.
//
// let c = 15
// let d = 2
// result = c + d
// console.log(result)


// 7. Вам даны переменные a=30, и b=15
// Сложите переменные a и b и результат присвойте переменной c.
// Затем выведите в консоль остаток деления на 4 переменной c.

// let a = 30
// let b = 15
// let d = 4
// c = a + b
// console.log(Math.ceil(c / d))

// 8. Вам даны переменные a=17 и b=10.
// Отнимите от a переменную b и результат присвойте переменной c.
// Затем создайте переменную d, присвойте ей значение.
// Сложите переменные c и d, а результат запишите в переменную result.
// Выведите в консоль значение переменной result.
//
// let  a = 17
// let b = 10
// let d = 20
// c = a-b
// result = c + d
// console.log(result)

// 9. Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте
// результат переменной result и выведите её в консоль.

// let a = '10'
//  let b = '99'
// result = Number(a * b )
// console.log(result)

// 10. Вам даны переменные name='Аскар',
// number=10. Сложите данные переменные,
// присвойте результат переменной result и выведите её в консоль.
// let name = 'Askar'
// let number = 10
// //
// result = name + number
// console.log(result)
// console.log(name.length + number)


// =>
// =<
// =
// !==
// let a = 12
// let b = 6
// let c = '12'
// console.log(a > b)
// console.log(b > a)
// console.log(a !== b)
// console.log(a === b)


// console.log(a === c)
// console.log(a == c)


// Number
// parseInt()
// +

//
// let w = '10'
// let s = "10"
// let name = 'Saviya'
// // console.log(Number(w))

//
// console.log(s + '')
//
// console.log(parseInt(name))
//
//
// console.log('Saviya' * 10)
// console.log(typeof NaN)
//
// console.log('red' + 'black')
// console.log('red' + 10)
//


// console.log(s)
// console.log(Number(w))

//  ==
//  ===


// String()
// toString()
// +''


// let num = 10
// console.log(String(num))
// console.log(num.toString())
//
// console.log(num + '')

// console.log('7' + 6)
// console.log(Number(7) + 6)
// console.log(+'7' + 6)
// console.log(parseInt('7') +  +"10")
// console.log(parseInt('7') +  Number("10"))
//


//
//
// if ('wert' === 'red'){
//   console.log("токто")
// }else if ('yellow' === 'green'){
//   console.log('ото бер')
// }else if('wert' === 'werwt') {
//   console.log('даярдан')
// }else{
//   console.log('js')
// }
//
//
// // &&
//
// // ||
//
//
// // true 1
// // // false 0
// //
// // console.log(true && true && true && false)
// // console.log()
// //

// // 1. Вам дана переменная a. Если переменная a равна 10,
// // то выведите 'Верно', иначе выведите 'Неверно'.
//
//
//
// // let a = 10
// //
// // if (a === 10){
// //   console.log("Верно")
// // }else {
// //   console.log("Неверно")
// // }
//
//
// // 2. Вам даны две переменные a=50, b=100. Составьте условие,
// // по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
//
//
// // let a = 50
// //
// // let b = 100
//
//
// // if (a > b){
// //   console.log('чон')
// // }else if (a < b){
// //   console.log('кичине')
// // }else {
// //   console.log('red')
// // }
//
// // console.log(a > b)
// // console.log(a < b)
//
// // 3. Вам дана переменная a=-2. Составьте условие, по которому
// // в консоль будет выводиться 'positive' - если число больше 0, 'равно'
// // если число равно 0, "negative" если число меньше 0.
//
// //
// // let a = -2
// // if (a > 0) {
// //   console.log('positive' )
// // }else if (a === 0){
// //   console.log('равно')
// // }else {
// //   console.log("negative")
// // }
//
// // 4. Вам дана переменная number=45. Составьте условие, по которому
// // будет выводиться в консоль "Четное число", "Нечетное число".
//
//
// // let number = 45
// // if (number % 2 === 0 ){
// //   console.log("Четное число")
// // }else {
// //   console.log("Нечетное число")
// // }
// // 5. Вам даны две переменные a=10, b=2. Составьте
// // условие, по которому, остаток деления a на b, будет
// // выводиться консоль "Четное число", "Нечетное число".
//
// // let a = 10
// // let b = 2
// //
// // if (a % b === 0){
// //   console.log("Четное число")
// // }else {
// //   console.log("Нечетное число")
// // }
//
//
//
//
//
//
// // 6. Вам дана переменная s. Составьте условие, по которому
// // в консоль будет выводится тип этой переменной - "boolean", "number", "string".
//
// // let s = '10'
// // console.log(typeof s)
//
// // 7. Вам дана переменная а. Если переменная a больше одного и
// // меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.
// // let a = 10
// // if (a > 1 && a < 9 ) {
// //   console.log('Верно')
// // }else {
// //   console.log("Не верно")
// // }
// // 8. Вам дана переменная а. Если переменная a равна трем или равна
// // семи, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое
// // значение переменной в консоль.
//
// // &&
// // ||
// // 0 "", null, undefined, false
// // console.log(false && true)
// // console.log(1 && "0" && "null" && "kjhi" && true  && 12)
//
//
//
//
// // let a = 100
// // if (a < 2 && a < 5){
// //   console.log("true")
// // } else if (a === 100 || a === 3){
// //   console.log(a + 7)
// // }else {
// //   console.log(a / 10)
// // }
// // 9. Вам даны переменные а , b. Если переменная a равна или меньше
// // 0, а переменная b больше или равна 5, то выведите сумму этих переменных,
// // иначе выведите их разность (результат вычитания).
// //
// // let a = 10
// // let b = 5
// //
// // if (a <= 0 && b>=0){
// //   console.log(a + b)
// // }else {
// //   console.log(a - b)
// // }
//
//
//
// // 10. Вам даны переменные a , b. Если переменная a больше 4-х и меньше 10-ти,
// // или переменная b больше или равна 7-ми и меньше 17-ти, то выведите
// // 'Верно', в противном случае выведите 'Неверно'.
//
//
// // let a = 8
// // let b =  10
// // if (a < 4 && a > 10  || b <= 7 &&  b < 17 ){
// //   console.log('Верно')
// // }else {
// //   console.log('Неверно')
// // }
// // 11. Вам дана переменная month. В ней лежит какое-то число
// // из интервала от 1 до 12. Определите в какую пору года попадает этот месяц
// // (зима, лето, весна, осень).
//
// // let month = 12
//
// // if (month === 12 || month === 1 || month ===2){
// //   console.log('Кыш')
// // }else if (month >= 3  && month < 6) {
// //   console.log('жаз')
// // }else if (month >= 6 && month < 9  ) {
// //   console.log('жай')
// // }else if (month >= 9 && month < 12){
// //   console.log("куз")
// // }
//
//
// // 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1 до 31.
// // Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
//

//
// // 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой
// // переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’,
// // в противном случае выведите ‘нет’.
//
// //
// let a = '12345'
// if (+a[0] === 1 || +a [0] === 2 || +a[0] === 3){
//   console.log('da')
// }else {
//   console.log('net')
// }
// // 14. Вам дана переменная age=*любое двузначное число*.
// // Составьте условие,
// // по которому, в консоль будет выводиться "Мне  год",
// // "Мне  лет", в зависимости
// // от возраста. Наример мне 21 год, мне 20 лет.
//
// let age = 4
// let a = age % 10
// let b = age % 100
// if (a === 1 && b!== 11){
//   console.log('мне'  +  age +  'год')
// }else if ((b !== 12 && b!==13 && b !==14) && (a === 2 ||
//   a ===3 || a===4)){
//   console.log('мне'  + age +  'года')
// }else {
//   console.log('мне'  + age +  'лет')
// }

// 15. Вам дана переменная time= *любое чило от 1 до 59*. Составьте
// условие, по которому время будет делиться на четверти. Пример:
// time = 12 - Первая четверть. Если число больше 60, то в консоли будет
// выдаваться "Неверное число".









// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно',
// иначе выведите 'Неверно'.


// let a = 100
// if (a===10) {
//   console.log('Верно')
// }else if (a === 100) {
//   console.log('иначе')
// }
// else  {
//   console.log('Неверно')
// }






// 2. Вам даны две переменные a=50, b=100. Составьте условие,
// по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// let a=50, b=100
// if (a>b){
//   console.log('a больше b')
// }
// else if (a<b){
//   console.log('a меньше b')
// }
// else
// {console.log("rovno")
// }




// 3. Вам дана переменная a=-2. Составьте условие, по которому в
// консоль будет выводиться 'positive' - если число больше 0,
// 'равно' если число равно 0, "negative" если число меньше 0.
// let a= -2
// if (a>0){
//   console.log("positive")
// }else if (a===0){
//   console.log("rovno")
// }else {
//   console.log("negative")
// }
// 4. Вам дана переменная number=45. Составьте условие,
// по которому будет выводиться в консоль "Четное число", "Нечетное число".
//
// let number = 55
//
// if(number % 2 ===0){
//   console.log("Четное число")
// }else{
//   console.log("Нечетное число")
// }


// 5. Вам даны две переменные a=10, b=2. Составьте условие,
// по которому, остаток деления a на b, будет выводиться консоль
// "Четное число", "Нечетное число".

//
// let a=10, b=2
// if (a %b ===0){
//   console.log("Четное число")
// }else {
//   console.log("Нечетное число")
// }


// 6. Вам дана переменная s. Составьте условие, по которому в
// консоль будет выводится тип этой переменной - "boolean", "number", "string".



// let s = 4, a = 'Barsbek', b= true
// console.log(typeof s)
// console.log(typeof a)
// console.log(typeof b)

// 7. Вам дана переменная  а. Если переменная a больше
// одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.

// let a = -52
//
// if(a > 1 ){
//   console.log('true')
// }else if (a < 9){
//   console.log('верно')
// }else {
//   console.log('false')
// }


// 8. Вам дана переменная а. Если переменная a равна
// трем или равна семи, то прибавьте к ней 7, иначе поделите
// ее на 10. Выведите новое значение переменной в консоль.
//
// let a = 40
// let b = 60
// let c = 10
// if (a === 40 ){
//   console.log(a + b)
// }else {
//   console.log(a / c)
// }


// 9. Вам даны переменные а , b. Если переменная a равна
// или меньше 0, а переменная b больше или равна 5, то
// выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
//
// let a = -2, b = 6
//
// if (a <= 0 && b <= 5){
//   console.log(a + b)
// }else {
//   console.log(a - b)
// }



// 10. Вам даны переменные a , b. Если переменная a больше
// 4-х и меньше 10-ти, или переменная b больше или равна
// 7-ми и меньше 17-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.


// let a = 11,b = 18
//
// if (a>4 && a<10 || b>=7 && b<17  ) {
//   console.log('Верно')
// }else {
//   console.log('Неверно')
// }






















// // 14. Вам дана переменная age=*любое двузначное число*.
// // Составьте условие,
// // по которому, в консоль будет выводиться "Мне  год",
// // "Мне  лет", в зависимости
// // от возраста. Наример мне 21 год, мне 20 лет.

// let age = 13
// let a = age % 10
// let b = age % 100
//
// if (a === 1 && b!== 11){
//   console.log('мне'  +  age +  'год')
// }else if ((b !== 12 && b!==13 && b !==14) && (a === 2 ||a ===3 ||
// a===4)){
//   console.log('мне'  + age +  'года')
// }else {
//   console.log('мне'  + age +  'лет')
// }
//



// // 11. Вам дана переменная month. В ней лежит какое-то число
// // из интервала от 1 до 12. Определите в какую пору года попадает этот месяц
// // (зима, лето, весна, осень).
//
// // let month = 12
//
// // if (month === 12 || month === 1 || month ===2){
// //   console.log('Кыш')
// // }else if (month >= 3  && month < 6) {
// //   console.log('жаз')
// // }else if (month >= 6 && month < 9  ) {
// //   console.log('жай')
// // }else if (month >= 9 && month < 12){
// //   console.log("куз")
// // }

// 11. Вам дана переменная month. В ней лежит какое-то число из интервала от 1 до 12. Определите в какую пору
// года попадает этот месяц (зима, лето, весна, осень).
//
// let are = 9
// if (are === 12 || are === 1 ||are ===2 ) {
//   console.log('кыш')
// }else if (are === 3 ||are === 4 ||are === 5){
//   console.log('жаз')
// }else if (are === 6 || are === 7 ||are ===8) {
//   console.log('жай')
// } else if (are === 9 || are === 10 || are ===11  ) {
//   console.log('куз')
// } else {
//   console.log('мында ай жоок')
// }


// let are = 12
// if (are>=3 && are<=5){
//   console.log('jaz')
// }else if (are >5 && are <=7) {
//   console.log('jai')
// }else if (are>8 && are <= 11){
//   console.log('kyz')
// }else if (are<= 12 || are < 1 || are < 2 ){
//   console.log('kysh')
// }else {
//   console.log('wert')
// }









// 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1 до 31.
// Определите в какую декаду
// месяца попадает это число (в первую, вторую или третью).
// let day = 211
// if (day >= 1 && day < 11 ) {
//   console.log('в первую')
// }else if (day >= 11 && day <= 20 ) {
//   console.log('вторую')
// }else if (day >=20 && day <=31) {
//   console.log('третью')
// }else {
//   console.log('мындай декада жоок')
// }

// 13. Вам дана переменная a='12345'. Проверьте, что первым символом
// этой переменной является цифра 1, 2 или
// 3. Если это так – выведите ‘да’, в противном случае выведите ‘нет’.



// let a = '42345'
// if (
//   +a[0]===3 ||+a[0] ===2 || +a[0]===1 ){
//   console.log('da')
// }else {
//   console.log('net')
// }

// 14. Вам дана переменная age=*любое двузначное число*.
// Составьте условие, по которому, в консоль будет
// выводиться "Мне  год", "Мне  лет", в зависимости от возраста.
// Наример мне 21 год, мне 20 лет.










// 11. Вам дана переменная month. В ней лежит какое-то число из
// интервала от 1 до 12. Определите в какую пору года попадает этот месяц
// (зима, лето, весна, осень).



// let are = 4
// if (are>=3 && are<=5){
//   console.log('jaz')
// }else if (are >5 && are <=7) {
//   console.log('jai')
// }else if (are>8 && are <= 11){
//   console.log('kyz')
// }else if (are<= 12 || are < 1 || are < 2 ){
//   console.log('kysh')
// }else {
//   console.log('wert')
// }
//
// let age = 9
// if (age===3 || age ===4 ||age===5) {
//   console.log('jaz')
// }else if (age ===6 || age===7 ||age===8) {
//   console.log('jai')
// }else if (age ===9 || age ===10 || age === 11) {
//   console.log('Kys')
// }else if (age===12 || age === 1 || age ===2) {
//   console.log('kysh')
// }







// 12. Вам дана переменная day. В ней лежит какое-то число из
// интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).



// let day = 12
//
// if (day >1 && day <=10 ) {
//   console.log('1')
// }else if (day >=11 && day <=20) {
//   console.log('2')
// }else if (day>=21 && day <=31){
//   console.log('3')
// }else {
//   console.log("мында декада жоок")
// }


// 13. Вам дана переменная a='12345'. Проверьте, что первым
// символом этой переменной является цифра 1, 2 или 3. Если это
// так – выведите ‘да’,
// в противном случае выведите ‘нет’.



// let a = '123456'
// if (+a[0]===3 || +a[0]===2 || +a[0] ===1) {
//   console.log('yes')
// }else {
//   console.log('noi')
// }






// 14. Вам дана переменная age=*любое двузначное число*. Составьте условие, по которому, в консоль будет выводиться "Мне  год", "Мне  лет", в зависимости от
// возраста. Наример мне 21 год, мне 20 лет.



// let age = 7
// let a = age % 10
// let b = age % 100
// if (a === 1 && b!== 11){
//   console.log('мне'  +  age +  'год')
// }else if ((b !== 12 && b!==13 && b !==14) && (a === 2 ||a ===3 || a===4)){
//   console.log('мне'  + age +  'года')
// }else {
//   console.log('мне'  + age +  'лет')
// }



















